// Задача 7. Показать числа от -N до N
Console.Write("Введите число N ");
int N = int.Parse(Console.ReadLine());
int i = -N; 
for (i = -N; i <=N; i++) 
Console.WriteLine(i);  
