//Задача: Написать сумму двух чисел
        
        // Первый вариант:

// int numberA = 3;
// int numberB = 5;
// Console.WriteLine(numberA + numberB);

        // Второй вариант:

// int numberA = 3;
// int numberB = 5;
// int result = numberA + numberB;
// Console.WriteLine(result);
        
        // Третий вариант

// int numberA = new Random().Next(1, 10);  //1 2 3 4 ... 9
// Console.WriteLine(numberA); // Покажем выбранное число
// int numberB = new Random().Next(1, 10);
// Console.WriteLine(numberB); 
// int result = numberA + numberB;
// Console.WriteLine(result);