// Найти индекс элемент массива равный значению find (4 строка кода)
// int [] array = {1, 12, 31, 4, 18, 15, 16, 17, 18};  // Задали массив

// int n = array.Length;   // Информация сколько элементов содержится внутри массива
// int find = 18;   // Определяем элемент массива, индекс элемента [3]

// int index = 0;  // Выбрали изначальный элемент с индексом [0]

// while (index < n)   // Определили диапазон, в котором будем проверять элементы на макс значение
// {
//     if (array[index] == find)   // Выполнение 2 условия задачи, если элемент массива по значению совпал с 4, то прекращаем поиск максимального
//     {
//         Console.WriteLine(index);   // Выводим на консоль индекс элемента массива со значением элемента find == 4 (строка 4 кода)
//         break;  // Остановить работу после нахождения первого элемента в массиве, соответствующего значению find
//     }
//     index++;    // index = index + 1
// }




