// 11. Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
int n = new Random().Next(10, 99);

Console.WriteLine(n(max));
// Последняя цифра пусть будет максимально, извлекаем её, если она не максимальная, значит максимальная вторая

// int number = 257;
// int a = (number / 10);
// int b = (a % 10);
// Console.WriteLine(b);

// double numberA = new Random().Next(1, 10);  //(1 2 3 4 ... 9) программа самостоятельно выбирает любое целое рандомное число от min до max
// double numberB = new Random().Next(1, 10);
// double result = (numberA / numberB);
// Console.WriteLine(result);


