// Задача: Разделить одно число на другое
// double numberA = 12;
// double numberB = 5;
// double result = (numberA / numberB);
// Console.Write(result);




double numberA = new Random().Next(1, 10);  //(1 2 3 4 ... 9) программа самостоятельно выбирает любое целое рандомное число от min до max
double numberB = new Random().Next(1, 10);
double result = (numberA / numberB);
Console.WriteLine(result);



